Repository: mozilla-l10n/mt-training-data
Catalog: mhk/mhk_pontoon.tmx
Source language: en_us
Languages: mhk

source: Swipe right to approve the sentence. Swipe left to reject it. Swipe up to skip it. <strong>Do not forget to submit your review!</strong>
mhk: Pad mfa ni bo lum ma chɔʼ ŋkaŋ chu. pad mfa ni bo ŋkəb ma bed. Pad ŋkɔʼ ma tad.<strong> Ma ndaʼni ŋkaŋchu yi u kitikɛd mɨ a bə!</strong>

source: Taking several attempts to read a word.
mhk: N-dɔʼ wani njamɨ ma fuŋ taʼ chu

source: Tap
mhk: Kɔd

source: Technology and Robotics
mhk: Nǔ mà tuʼmɨ kê mfi boa nǔ bà-ŋkwendɔ̀ʼ

source: Thank you for contributing your bulk submission!
mhk: Njika njə̂ u cheʼni yu buʼ ke a.

source: Thank you for contributing your voice!
mhk: Njika njə u fa nji u a

source: Thank you for donating your voice clips!
mhk: Njika njə u fa nji u a

source: Thank you for recording!<lineBreak></lineBreak>Now review and submit your clips below.
mhk: Njika ma teb!<lineBreak></lineBreak> Kuʼ nkiti, ncheʼni yu tebkɛd ndindi ma chɨŋnni

source: Thank you for your voice information
mhk: Njika njə u fa nji u a

source: The bumblebee sped by.
mhk: Nyɔŋ-du lɛ lǎ ni ndə

source: The clip has disrespectful or offensive language.
mhk: ŋgwen tebteb lɛ ni chu mbɨkɛd

source: The giant dinosaur of the Triassic.
mhk: Ndum-nyam lɔʼ ma Trassic

source: The giant dinosaurs of the Triassi-.
mhk: Ndum-nyam lɔʼ ma Trassic

source: The giant dinosaurs of the Triassic.
mhk: Ndum-nyam lɔʼ ma Trassic

source: The giant dinosaurs of the Triassic. <strong>[read by one voice]</strong>
mhk: Ndum nyam lɔʼ ma Trassic <strong>[fuŋ ni taʼ nji]</strong>

source: The giant dinosaurs of the Triassic. Yes.
mhk: Ted me jam mɨ nda nduŋ

source: The giant dino <strong>[cough]</strong> the Triassic.
mhk: Ndum nyam lɛ <strong>[kəʼ]</strong> ma Triassic.

source: There are currently no sentences to review in this language.
mhk: Yɔ chu ma mbə ni mɔʼ ŋkaŋchu ndindi ma kuʼ ŋkiti bə.

source: The recording was too long.
mhk: Teb lɛ saʼ ti

source: The recording was too quiet.
mhk: Nji teb lɛ bɔd ti

source: The recording was too short.
mhk: Teb lɛ kɛnti ti

source: There will be natural variations in volume between readers. Reject only if the volume is so high that the recording breaks up, or (more commonly) if it is so low that you can’t hear what is being said without reference to the written text.
mhk: Bimɔʼ chɨʼtikɛd to bə ni nu nji majɔʼ ghaŋ-mfuŋfuŋ.bed njə nji i bə ntɨn ti a ye ŋga teb chəd a kɛ (ni jama ndib) nji i bə nswi ti yi a ye ŋga bo ma nyuʼ nu bo ni nsuŋ a bə

source: The Sentence Collector is moving to the core Common Voice platform. You can now <writeURL>write</writeURL> a sentence or <reviewURL>review</reviewURL> single sentence submissions on Common Voice.
mhk: ŋgaŋ kə ŋkaŋ-chu ni ntiʼ ncho maji Common Voice. Ndindi, u bə ma <writeURL>ŋwàʼni</writeURL>ŋkaŋ-chu kɛ <reviewURL>kuʼ nkiti</reviewURL> nu ma cheʼni taʼtaʼ ŋkaŋ-chu ni Common Voice

source: The sentence has a grammatical or spelling error.
mhk: Yɔ ŋkaŋ-chu kam mad chu / A ni ŋwaʼni kɨbɔŋ

source: The sentence has disrespectful or offensive language.
mhk: Yɔ ŋkaŋ-chu kam wɔmti / a ni chu bɨg

source: The sentence must be grammatically correct.
mhk: Mad ma chu yɔ ŋkaŋchu bə ma bə nchinikɛd

source: The sentence must be speakable.
mhk: ŋkaŋchu lin ma bə ni manji ma chu

source: The sentence must be spelled correctly.
mhk: Yɔ ŋkaŋ chu bə ma ŋwaʼni mbɔŋkɛd

source: This information is optional to provide - you should only add it if you feel comfortable. When we release the dataset, we pseudonymise all personal information, and make sure information like your name and email are not connected to demographic information like age or sex.
mhk: Yɔ tɔʼti kɨ bə ni kan ma fa bə - kuʼti njə u bə ŋkɔŋ a. Bɨ bi tuʼmɨ bɔ ke, bɨ to ləmɨ ke a kɔti u a njə yu lɨŋ bo ŋkaŋ-ma-mfəʼ, lum u

source: Three to go!
mhk: Waŋ ited ma biʼni.

source: Too many files
mhk: Buʼ ŋwàʼnì lɛ jam tì

source: Transcribe audio recordings into text
mhk: Bɨti teb yuʼti-yuʼti ni miʼ ŋwaʼni

source: Transcribe audio recordings in your language
mhk: Kɨbti mad teb ni yu chu ŋgɔŋ

source: Try again by dragging your file here
mhk: Waŋni mɔʼŋka mà sǔŋ yu buʼ ŋwàʼnì ghaʼ

source: Try uploading again
mhk: Waŋni mà tuʼmɨ mɔʼ ŋka

source: Understand contribution criteria
mhk: Ji nɔʼɨ ma fa yum

source: Understand what to look for when listening to voice clips and help make your voice recordings richer too!
mhk: Ji yum u ni ntaʼ a njə u ni njuʼti tebkɛd a nje sɛ ŋga nji u leni

source: Upload aborted. Do you want to delete your recordings?
mhk: Ma tuʼmɨ kɨ faʼ bə. U taʼ ma vəʼti yu teb kɛd ɛ?

source: { $uploadedSentences } of { $totalSentences } sentences collected
mhk: { $uploadedSentences } bun kɛti ŋkaŋ chual { $totalSentences } 1 bo kə taʼ ŋkaŋ-cnu

source: { $uploadedSentences } of { $totalSentences } sentences collected. Click <downloadLink>here</downloadLink> to download rejected sentences.
mhk: { $uploadedSentences } nyin ŋgɔŋ ŋkaŋ-chu mbomti-mbomti ni 1. Fed <downloadLink>here</downloadLink> ma tuʼmɨ ŋkaŋ-chukɛd bo bed a

source: Upload failed, please retry.
mhk: à kɨ tum bə, mbuʼmbo biʼti.

source: Upload <icon></icon> public domain sentences
mhk: Tuʼmɨ <icon></icon> ŋkâŋ-chu mvi ti njə a

source: Upload in progress...
mhk: A ma manji ni ntum ...

source: Upload more sentences?
mhk: uUkuʼ tuʼmɨ bìmɔʼ ŋkâŋ-chu ɛ?

source: Use correct grammar
mhk: Ŋwàʼni ŋguli chu

source: Use correct spelling and punctuation
mhk: Ŋwàʼni mbɔ̀ŋkɛd boa chɨ̀ʼtì.

source: Validate Readings
mhk: Fa bati ni

source: Validate Readings, Review Transcriptions
mhk: Fa yu bati ni njə bo fuŋ a, kuʼ ŋkiti chu bo bɨtikɛd

source: Validate Readings <small>(Coming soon)</small>
mhk: Fa bati ni mbi yɔ ŋkaŋ-ŋwaʼni <small>(ndib miya)</small>

source: Validate readings submitted by community members
mhk: Fa yu bati ŋjə ghaŋ ŋgɔŋ fuŋ nchəʼni a

source: Validate user-recorded readings in your language
mhk: Fa yu bati mbiʼ yɔ teb ni chu ŋgɔŋ u

source: Varying Pronunciations
mhk: Lɨm fuŋ yum njɨiʼnjɨ̀

source: Volume
mhk: Nji

source: Want to save your information? <createProfile>Create a profile</createProfile>
mhk: U ni ntaʼ ma chiʼ yu ŋgam ɛ? <createProfile>ŋaʼɨ yu lad ŋwaʼni</createProfile>

source: We are going out to get a coffee.
mhk: Bɨ/Ba ŋgə taʼ nchi ntonkɛd no

source: We are going out to get coffee.
mhk: Bɨ/Ba ŋgə taʼ nchi ntonkɛd no

source: We couldn’t get any audio clips for you to listen to. Please try again later.
mhk: Bɨ ma mbə ni mɔʼ mbo u ma yuʼti bɛ. Mbuʼmbo waŋni mɔʼ ŋka ndib miya

source: We couldn’t get any sentences for you to speak. Please try again later.
mhk: Bɨ kɨ yə bi;mɔʼ ŋkaŋ-chu mbo u ma chu bə. Mbuʼmbo waŋni mɔʼ ŋka ndib miya

source: We may have run out of clips - refresh the page, or try again later.
mhk: A chi njə ba ma ŋkuʼ mbə ni teb bə. Kuʼ ŋaʼɨ yɔ lad ŋwaʼni kɛ u biʼti ni mɔʼ ndib.

source: We’re going out to get coffee.
mhk: Bɨ/Ba ŋgə taʼ nchi ntonkɛd no

source: We're making some big changes
mhk: Bɨ ni yə bimɔʼ kɨbti ŋgɨŋgɨ

source: We’re sorry, your platform is not currently supported.
mhk: Bɨ sɔbni, yu ......... Kɨ bə ni yemti bə.

source: We've run out of sentences to record in this language...
mhk: Bɨ kam ŋkaŋ-chu ma teb ni yɔ chu

source: We want the machine learning algorithms to able to handle a variety of background noise, and even relatively loud noises can be accepted provided that they don’t prevent you from hearing the entirety of the text. Quiet background music is OK; music loud enough to prevent you from hearing each and every word is not.
mhk: Bɨ ni ntaʼ nga nu ma duʼti ŋwaʼni ni masɨn lin ma faʼ boa chukɛd manjam, bo lin ma bim chukɛd ni tɨn sɛ njə a ti ma mfa ŋgəʼ mbo u ma yuʼni a bə. Jɔbnchi mbɔnikɛd manjam bə ŋkuʼnikɛd. Bo kɨ bim nu jɔbnchi a ni chu nitɨn ni mfa ŋgəʼ mbo u ma yuʼni a bə

source: What issues are you experiencing with this sentence?
mhk: A ilaʼ ke yi u la mɨ ni yɔ ŋkaŋ-chu a?

source: What needs to be in my file?
mhk: â ntaʼ ke mà bə maji yǎ buʼ ŋwàʼnì?

source: What sentences can I add?
mhk: A ìlaʼ ŋkǎŋ-chu n-din mà kùʼti a ?

source: When listening, check very carefully that what has been recorded is exactly what has been written; reject if there are even minor errors. <br />Very common mistakes include:
mhk: ma yuʼti, kiti mbɔŋkɛd ŋga ke a ma ndun teb a be ke bo ŋwaʼnikɛd a;<br /> bon fanti bə mbe fɔʼ u bed

source: Why are you asking?
mhk: U bɛti bə mbiʼ kə?

source: With a profile, you can keep track of your activity and connect with a community of voice data contributors.
mhk: U bə ŋaʼɨ yu lad ŋwàʼni, u to ti mbati njə faʼ u ni njid a, bumti sɛ bi a bimɔʼ bun bo fa tɔʼti mbiʼ nji yab a

source: Write
mhk: Ŋwàʼni

source: Write options menu
mhk: Ŋwaʼni tu nu kɛd

source: y
mhk: n̂

source: Y
mhk: n̂

source: Yes
mhk: n̂

source: You can also use Keyboard Shortcuts: { sc-review-form-button-approve-shortcut } to Approve, { sc-review-form-button-reject-shortcut } to Reject, { sc-review-form-button-skip-shortcut } to Skip
mhk: U be ma faʼ ni chəlikɛd sɛ: { sc-review-form-button-approve-shortcut } ma bim, { sc-review-form-button-reject-shortcut } ma bed, { sc-review-form-button-skip-shortcut } ma tad.

source: You cannot add multiple sentences for a single submission
mhk: U ma ndin ma kuʼti ŋkaŋ-chu nchubtichubti ma cheʼni ni taʼ waŋ bə

source: You have not selected any languages. Please go to your <profileLink>Profile</profileLink> to select languages.
mhk: U kɨ ted nchɔʼ mɔʼ chu bə. Mbuʼmbo ghə ma <profileLink>Profile</profileLink> ma chɔʼ yu chu

source: You have reached the submission limit for this page. Please wait for { $retryLimit } minutes before submitting another sentence. Thank you for your patience!
mhk: Yɔ yu nanjam ŋka ma cheʼni ni yɔ lad ŋwaʼni. U ntaʼ ma beb { $retryLimit } minute nji cheʼni mɔʼ lad ŋwaʼni fi. Njika ma beb!

source: You have reached the submission limit for this page. Please wait for { $retryLimit } seconds before submitting another sentence. Thank you for your patience!
mhk: Yɔ yu nanjam ŋka ma cheʼni ni yɔ lad ŋwaʼni. U ntaʼ ma beb { $retryLimit } secon nji cheʼni mɔʼ lad ŋwaʼni fi. Njika ma beb!

source: You must allow microphone access.
mhk: U lin ma ye ŋgâ yum kuʼti nji bə wuʼ.

source: You’re contributing to a target segment
mhk: U ni mfa bati ni mɔʼ kɛnti faʼ

source: You’re contributing to our first target segment
mhk: U ni mfa bati ni yɨʼ sɨ kɛnti faʼ

source: You're going too fast. Please take a moment to review the sentence to make sure it's correct.
mhk: U ŋgə ni ndə. Mbuʼmbo lɔʼ;mo ndib ma kuʼ ŋkiti yɔ ŋkaŋ chu ma yə ŋga a ŋkuʼnikəd.

source: You're helping Common Voice reach our daily sentence goals!
mhk: U nì ŋgyemti Common Voice mà bə nì nduŋ ŋkâŋ-chu bo taʼ a.

source: Your language variant might be out of clips! If you’re comfortable, you can change your settings to see other sentences within your language.
mhk: Nu yu chu-ŋgɔŋ ma mbə ni ŋkaŋ chu bə mɔʼ ŋka bə! U bə ŋkɔŋ u ye bìmɔʼ chəʼtì ma yə bìmɔʼ ŋkaŋ-chu ni yu chu ŋgɔŋ

source: Your language variant might be out of sentences! If you’re comfortable, you can change your settings to see other sentences within your language.
mhk: Nu yu chu-ŋgɔŋ ma mbə ni ŋkaŋ chu bə mɔʼ ŋka bə! U bə ŋkɔŋ u ye bìmɔʼ chəʼtì ma yə bìmɔʼ ŋkaŋ-chu ni yu chu ŋgɔŋ

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
mhk: U yemti Common Voice ma ye <goalPercentage></goalPercentage> i bo faʼ nchuʼmvi { $goalValue } ni nu ma teb.

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
mhk: U yemti Common Voice ma che <goalPercentage></goalPercentage>i bo faʼ nchuʼmvi ! { $goalValue }
